In [2]:
import pandas as pd

In [3]:
## series 
## A pandas series is a one-D array-like object that can hold anny data type
#  it is similiar to a column in a table

data = [1,2,3,4,5]
series = pd.Series(data)
print("series: \n",series)

series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
## create a series from dictionary

data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data =[10,20,30]
index= ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
## Data Frame
data = {
    "Name":["krish","john","jack"],
    "age":[25,30,32],
    "City":["DLI","NYC","Florida"]
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  age     City
0  krish   25      DLI
1   john   30      NYC
2   jack   32  Florida
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['krish', 25, 'DLI'],
       ['john', 30, 'NYC'],
       ['jack', 32, 'Florida']], dtype=object)

In [8]:
## create a DF from a list of dictionaries
data = [
    {"Name":"krish","Age":25,"City":"Delhi"},
    {"Name":"john","Age":26,"City":"Mumbai"},
    {"Name":"max","Age":31,"City":"New York"},
    {"Name":"Sheldon","Age":33,"City":"Taxses"}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age      City
0    krish   25     Delhi
1     john   26    Mumbai
2      max   31  New York
3  Sheldon   33    Taxses
<class 'pandas.core.frame.DataFrame'>

In [14]:
## Accessing data from dataframe
df = pd.DataFrame(data)
df["Name"]

0      krish
1       john
2        max
3    Sheldon
Name: Name, dtype: object

In [15]:
df.loc[0]

Name    krish
Age        25
City    Delhi
Name: 0, dtype: object

In [18]:
df.iloc[0][2]

C:\Users\sagar\AppData\Local\Temp\ipykernel_12684\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Delhi'

In [20]:
## Accessing a specified element
print(df)
df.at[1,"Age"]

      Name  Age      City
0    krish   25     Delhi
1     john   26    Mumbai
2      max   31  New York
3  Sheldon   33    Taxses

np.int64(26)

In [21]:
## Accessing a specified element iat

df.iat[2,2]

'New York'

In [23]:
#data manipulation with dataframes

## add a column
df['Salary']=[50000,54000,39000,41000]
df

      Name  Age      City  Salary
0    krish   25     Delhi   50000
1     john   26    Mumbai   54000
2      max   31  New York   39000
3  Sheldon   33    Taxses   41000

In [26]:
## remove a column
# by defaul it will be axis = 0 means the column
#  we have to convert into axis = 1
# inplace = True its imp otherwise it will not delete it permanently
df.drop("Salary",axis = 1,inplace = True)

In [27]:
df

      Name  Age      City
0    krish   25     Delhi
1     john   26    Mumbai
2      max   31  New York
3  Sheldon   33    Taxses

In [32]:
df['Age'] = df["Age"]-1
df

      Name  Age      City
0    krish   26     Delhi
1     john   27    Mumbai
2      max   32  New York
3  Sheldon   34    Taxses

In [35]:
df = pd.read_csv("data.csv")

In [36]:
df.describe()

             Index
count  10000.00000
mean    5000.50000
std     2886.89568
min        1.00000
25%     2500.75000
50%     5000.50000
75%     7500.25000
max    10000.00000